Final Project/code/2D/Nx2-mesh/diamond-2D-Nx2/system/blockMeshDict
// Diamond Airfoil Mesh Generation
// Parameters:
// L (chord) = 1.0
// Theta (deflection angle)  =  10.0
// DL (fore)  =  1.0
// DR  (wake) =  1.5
// H  (top/bottom) = 1.0

/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(   
     (5.0000000000000e-01 0.000000e+00 -5.0000000000000e-02) // 0
     (3.0616169978684e-17 8.816349e-02 -5.0000000000000e-02) // 1
     (-5.0000000000000e-01 1.079691e-17 -5.0000000000000e-02) // 2
     (-9.1848509936051e-17 -8.816349e-02 -5.0000000000000e-02) // 3
     (2.0000000000000e+00 0.000000e+00 -5.0000000000000e-02) // 4
     (2.0000000000000e+00 1.088163e+00 -5.0000000000000e-02) // 5
     (5.0000000000000e-01 1.088163e+00 -5.0000000000000e-02) // 6
     (3.0616169978684e-17 1.088163e+00 -5.0000000000000e-02) // 7
     (-5.0000000000000e-01 1.088163e+00 -5.0000000000000e-02) // 8
     (-1.5000000000000e+00 1.088163e+00 -5.0000000000000e-02) // 9
     (-1.5000000000000e+00 1.332616e-16 -5.0000000000000e-02) // 10
     (-1.5000000000000e+00 -1.088163e+00 -5.0000000000000e-02) // 11
     (-5.0000000000000e-01 -1.088163e+00 -5.0000000000000e-02) // 12
     (-3.0616169978684e-17 -1.088163e+00 -5.0000000000000e-02) // 13
     (5.0000000000000e-01 -1.088163e+00 -5.0000000000000e-02) // 14
     (2.0000000000000e+00 -1.088163e+00 -5.0000000000000e-02) // 15
     (5.0000000000000e-01 0.000000e+00 5.0000000000000e-02) // 16
     (3.0616169978684e-17 8.816349e-02 5.0000000000000e-02) // 17
     (-5.0000000000000e-01 1.079691e-17 5.0000000000000e-02) // 18
     (-9.1848509936051e-17 -8.816349e-02 5.0000000000000e-02) // 19
     (2.0000000000000e+00 0.000000e+00 5.0000000000000e-02) // 20
     (2.0000000000000e+00 1.088163e+00 5.0000000000000e-02) // 21
     (5.0000000000000e-01 1.088163e+00 5.0000000000000e-02) // 22
     (3.0616169978684e-17 1.088163e+00 5.0000000000000e-02) // 23
     (-5.0000000000000e-01 1.088163e+00 5.0000000000000e-02) // 24
     (-1.5000000000000e+00 1.088163e+00 5.0000000000000e-02) // 25
     (-1.5000000000000e+00 1.332616e-16 5.0000000000000e-02) // 26
     (-1.5000000000000e+00 -1.088163e+00 5.0000000000000e-02) // 27
     (-5.0000000000000e-01 -1.088163e+00 5.0000000000000e-02) // 28
     (-3.0616169978684e-17 -1.088163e+00 5.0000000000000e-02) // 29
     (5.0000000000000e-01 -1.088163e+00 5.0000000000000e-02) // 30
     (2.0000000000000e+00 -1.088163e+00 5.0000000000000e-02) // 31
);

blocks
(
    hex (0 4 5 6 16 20 21 22) (96 64 1) simpleGrading (1 1 1) // block 0
    hex (6 7 1 0 22 23 17 16) (192 64 1) simpleGrading (1 1 1) // block 1
    hex (7 8 2 1 23 24 18 17) (192 64 1) simpleGrading (1 1 1) // block 2
    hex (8 9 10 2 24 25 26 18) (48 64 1) simpleGrading (1 1 1) // block 3
    hex (2 10 11 12 18 26 27 28) (48 64 1) simpleGrading (1 1 1) // block 4
    hex (12 13 3 2 28 29 19 18) (192 64 1) simpleGrading (1 1 1) // block 5
    hex (13 14 0 3 29 30 16 19) (192 64 1) simpleGrading (1 1 1) // block 6
    hex (14 15 4 0 30 31 20 16) (96 64 1) simpleGrading (1 1 1) // block 7
); 


edges
(
);



boundary
(
    inlet
    {
        type patch;
        faces
        (
            (11 27 26 10)
            (10 26 25 9)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (5 21 20 4)
            (4 20 31 15)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (11 27 28 12)
            (12 28 29 13)
            (13 29 30 14)
            (14 30 31 15)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (9 25 24 8)
            (8 24 23 7)
            (7 23 22 6)
            (6 22 21 5)
        );
    }
    obstacle
    {
        type patch;
        faces
        (
            (0 16 17 1)
            (1 17 18 2)
            (2 18 19 3)
            (3 19 16 0)
        );
    }
);


mergePatchPairs
(
);
